; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	thermograph3 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	thermograph2 - mode
	Star0 - direction
	Star1 - direction
	Star7 - direction
	Star3 - direction
	GroundStation4 - direction
	Star5 - direction
	Star2 - direction
	GroundStation6 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star7)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument2 thermograph3)
	(supports instrument2 thermograph2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star5)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(pointing satellite0 Star9)
	(pointing satellite1 Star5)
	(have_image Star8 thermograph2)
	(have_image Star9 thermograph3)
	(have_image Star10 spectrograph0)
	(have_image Planet11 spectrograph1)
	(have_image Phenomenon12 spectrograph0)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 7
2. (calibrate satellite1 instrument2 star5)
   added: (calibrated instrument2)
   goals met: 1 of 7
3. (turn_to satellite1 star10 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star10)
   goals met: 0 of 7
4. (take_image satellite1 star10 instrument2 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 1 of 7
5. (turn_to satellite1 phenomenon12 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 phenomenon12)
   goals met: 1 of 7
6. (take_image satellite1 phenomenon12 instrument2 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 2 of 7
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 7
8. (calibrate satellite0 instrument0 star7)
   added: (calibrated instrument0)
   goals met: 2 of 7
9. (turn_to satellite0 planet11 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet11)
   goals met: 2 of 7
10. (take_image satellite0 planet11 instrument0 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 3 of 7
11. (turn_to satellite0 star9 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star9)
   goals met: 4 of 7
12. (turn_to satellite1 star8 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star8)
   goals met: 4 of 7
13. (take_image satellite1 star8 instrument2 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 5 of 7
14. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 5 of 7
15. (take_image satellite1 star9 instrument2 thermograph3)
   added: (have_image star9 thermograph3)
   goals met: 6 of 7
16. (turn_to satellite1 star5 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star5)
   goals met: 7 of 7
